app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date
---
  def index
    @all_ratings=Movie.ratings
    @checked_boxes=@all_ratings

    if params[:ratings]
        @checked_boxes=params[:ratings]
    elsif session[:ratings]
        @checked_boxes=session[:ratings]
        redirect=true
    end
    if params[:sort_by]
        @sorting=params[:sort_by]
    elsif session[:sort_by]
        @sorting=session[:sort_by]
        redirect=true
    end
    if redirect
        redirect_to movies_path( :sort_by=>@sorting, :ratings=>@checked_boxes)
    end
    @movies = Movie.order(@sorting).find_all_by_rating(@checked_boxes.keys)